# Задача-1: используя цикл запрашивайте у пользователя число пока оно не станет больше 0, но меньше 10.
# После того, как пользователь введет корректное число, возведите его в степерь 2 и выведите на экран.
# Например, пользователь вводит число 123, вы сообщаете ему, что число не верное,
# и сообщаете об диапазоне допустимых. И просите ввести заного.
# Допустим пользователь ввел 2, оно подходит, возводим в степень 2, и выводим 4

number = int(input('Input number:'))
while number <= 0 or number >= 10:
    number = int(input('Number is incorrect. Input in range 1 ... 9: '))
number **= 2
print(number)

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;

f: int = int(input('Input number f: '))
g: int = int(input('Input number g: '))
f = f ^ g
g = g ^ f
f = f ^ g
print('f: ', f)
print('g: ', g)
